#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kiIIer/kubernetes-ops-staging-20-eks/runs/run-LAGcGUcHx7LnUN9Y

Waiting for the plan to start...

Terraform v1.8.4
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/staging/cluster]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-09a0c610b25cd832c]
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_kms_key.eks: Refreshing state... [id=da0ac631-723e-43c7-8e17-36ae4c56e4da]
module.eks.module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Reading...
module.eks.module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-081e413ca3d93037a]
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.module.eks.module.fargate.data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Reading...
module.eks.module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Read complete after 0s [id=2829572932]
module.eks.module.eks.module.fargate.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Reading...
module.eks.module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Read complete after 0s [id=2764486067]
module.eks.module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::533267183023:policy/staging-elb-sl-role-creation20240529024214589900000001]
module.eks.module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Read complete after 0s [id=3778018924]
module.eks.module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=staging20240529024214591100000003]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=533267183023]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=staging20240529024214591100000003-20240529024214881700000007]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=staging20240529024214591100000003-20240529024214853500000006]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=staging20240529024214591100000003-20240529024214881900000008]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=staging20240529024214591100000003-20240529024214844000000005]
module.eks.module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3931554295]
module.eks.module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-3547371180]
module.eks.module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-4206148016]
module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2168133004]
module.eks.module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-4155960165]
module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3785068222]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=staging]
module.eks.module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["100.64.0.0/16"]: Refreshing state... [id=sgrule-3169053977]
module.eks.module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["172.16.0.0/12"]: Refreshing state... [id=sgrule-2246935333]
module.eks.module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["192.168.0.0/16"]: Refreshing state... [id=sgrule-1444353562]
module.eks.module.eks.aws_iam_role.workers[0]: Refreshing state... [id=staging20240529025810256500000001]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::533267183023:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/BE719441A252D6849FF13E62E0266685]
module.eks.module.eks.aws_security_group_rule.cluster_private_access_cidrs_source["10.0.0.0/8"]: Refreshing state... [id=sgrule-1372338134]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=staging20240529025810256500000001-20240529025810510600000004]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=staging20240529025810256500000001-20240529025810494000000002]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=staging20240529025810256500000001-20240529025810501400000003]
module.eks.data.aws_eks_cluster.cluster: Reading...
module.eks.data.aws_eks_cluster_auth.cluster: Reading...
module.eks.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=staging]
module.eks.data.aws_eks_cluster.cluster: Read complete after 1s [id=staging]
module.eks.module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "wait_for_cluster" {
      + body             = (known after apply)
      + ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDBTCCAe2gAwIBAgIIeo0pbVu9Z+kwDQYJKoZIhvcNAQELBQAwFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczAeFw0yNDA1MjkwMjQ5MjBaFw0zNDA1MjcwMjU0MjBaMBUx
            EzARBgNVBAMTCmt1YmVybmV0ZXMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK
            AoIBAQDz8Vd4PFYzpqYfau0FmRXJiFjELM07/5TW7c05b5uFUZ217RIqlnK3r8ur
            VWKlpvwTKs1rBbaIE/uue460rzRTA/VkjkFIVgfW1DFOFRD9tIF3jE80dMweCGeA
            0T7R77OBRAD1ECkn8sZZqZIAH71xERlgiwgHzv2ygKbwWnff3ZAE8k3zBsuNPd9U
            qGlrd0B2dBK3EptbM/7xer1BzWmLkpjWbu0BdfVgGqL1wpV/eFj1qXkGODRQ+y3f
            2N0nDKFUcxq76U/XY51XwJUKjeyalG23/mTvBlSkiFg61Ag6Lpu0NrhlIrBOK1om
            3OFXWiZM+dI2pUwxO+MTe6ygXDBNAgMBAAGjWTBXMA4GA1UdDwEB/wQEAwICpDAP
            BgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBS17IYHtZ7aql73gRMjqzjcIog2pzAV
            BgNVHREEDjAMggprdWJlcm5ldGVzMA0GCSqGSIb3DQEBCwUAA4IBAQBZiWoR8mPZ
            KaQ9YJ0eSV21P2Mcq4g9SuMQo7Mhb7ZxXjfOg4In5fcNiQk8i0JK6LsgBDFM3R/Q
            2kdzGLyFATnu8IrdSRJXuwvtTqqAIZMbVPbgquHu6kCS2qkj/H3VK1BLsG1cvmnH
            Ix+14XWGqn7ogoo+enhytCkg77/CHYJAd9hsHfDFIUFZ1+4lElHMCq7R2/70wrEG
            YoHn9ko/o45kJPsVVNpj5mlZOBx/SJkWgJBqYIWs6V3OZ/rd5cZtr0UB7q9hH+aS
            3i2jkeS25X6YEgB7yetladWtBwfP7QRIFxOIbgAIEQrZQiyxx/ZKb6GbTvWeLgQq
            Whg9pUzKJMpt
            -----END CERTIFICATE-----
        EOT
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = "https://BE719441A252D6849FF13E62E0266685.gr7.eu-north-1.eks.amazonaws.com/healthz"
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                        = "staging"
        name                      = "staging"
        tags                      = {
            "ops_env"              = "staging"
            "ops_managed_by"       = "terraform"
            "ops_owners"           = "devops"
            "ops_source_repo"      = "kubernetes-ops"
            "ops_source_repo_path" = "terraform-environments/aws/staging/20-eks"
        }
      ~ version                   = "1.30" -> "1.29"
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.eks.module.node_groups.aws_eks_node_group.workers["ng1"] will be created
  + resource "aws_eks_node_group" "workers" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "staging"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "staging-ng1"
      + node_role_arn          = "arn:aws:iam::533267183023:role/staging20240529025810256500000001"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0061d4fe22b70833d",
          + "subnet-078760455117b383d",
          + "subnet-0e4bd7650fb0bb4de",
        ]
      + tags                   = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/20-eks"
        }
      + tags_all               = {
          + "ops_env"              = "staging"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/staging/20-eks"
        }
      + version                = "1.29"

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + timeouts {}
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-LAGcGUcHx7LnUN9Y/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```


</details>

*Pusher: @kiIIer, Action: `pull_request`*